# This will be the Jupyter Notebook Answer Sheet for this project.

In [111]:
import pandas as pd
import sqlite3
con = sqlite3.connect('sqlite_db_pythonsqlite.db')
cur = con.cursor()

Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do.

A1: <br>

><code>SELECT name <br>
>FROM Facilities <br>
>WHERE membercost > 0; </code>

In [112]:
# Using only sqlite3.
cur.execute('SELECT name FROM Facilities WHERE membercost > 0')
no_fee_fac = cur.fetchall()
for fac in no_fee_fac:
    print(fac)

('Tennis Court 1',)
('Tennis Court 2',)
('Massage Room 1',)
('Massage Room 2',)
('Squash Court',)

In [113]:
# Using sqlite3 and pandas.
no_fee_df = pd.read_sql_query('SELECT name FROM Facilities WHERE membercost > 0', con)
no_fee_df

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

Q2: How many facilities do not charge a fee to members?

A2: <br>

><code>SELECT COUNT(name) AS num_no_fee <br>
>FROM Facilities <br>
>WHERE membercost = 0; </code>

In [114]:
# Using only sqlite3.
cur.execute('SELECT COUNT(name) as num_no_fee FROM Facilities WHERE membercost = 0')
no_fee_count = cur.fetchall()
for fac in no_fee_count:
    print(fac)

(4,)

In [115]:
# Using sqlite3 and pandas.
no_fee_df = pd.read_sql_query('SELECT COUNT(name) AS num_no_fee FROM Facilities WHERE membercost = 0', con)
no_fee_df

   num_no_fee
0           4

Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

A3:<br>

><code>SELECT facid, name, membercost, monthlymaintenance <br>
>FROM Facilities<br>
>WHERE membercost > 0<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AND membercost < (monthlymaintenance * 0.2); </code>

In [116]:
# Using only sqlite3.
cur.execute('SELECT facid, name, membercost, monthlymaintenance FROM Facilities WHERE membercost > 0 AND membercost < (monthlymaintenance * 0.2)')
query3 = cur.fetchall()
for fac in query3:
    print(fac)

(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)

In [117]:
# Using sqlite3 and pandas.
query3df = pd.read_sql_query('SELECT facid, name, membercost, monthlymaintenance FROM Facilities WHERE membercost > 0 AND membercost < (monthlymaintenance * 0.2)', con)
query3df

   facid            name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

A4:<br>

><code>SELECT *<br>
>FROM Facilities<br>
>WHERE facid IN (1, 5);</code>

In [118]:
# Using only sqlite3.
cur.execute('SELECT * FROM Facilities WHERE facid IN (1, 5)')
query4 = cur.fetchall()
for fac in query4:
    print(fac)

(1, 'Tennis Court 2', 5, 25, 8000, 200)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)

In [119]:
# Using sqlite3 and pandas.
query4df = pd.read_sql_query('SELECT * FROM Facilities WHERE facid IN (1, 5)', con)
query4df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25,8000,200
1,5,Massage Room 2,9.9,80,4000,3000

Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

A5:<br>

><code>SELECT name, monthlymaintenance,<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;IIF(monthlymaintenance>100, "expensive", "cheap")<br>
>FROM Facilities;</code>

In [120]:
# Using only sqlite3.
cur.execute('SELECT name, monthlymaintenance, IIF(monthlymaintenance>100, "expensive", "cheap") FROM Facilities')
query5 = cur.fetchall()
for fac in query5:
    print(fac)

('Tennis Court 1', 200, 'expensive')
('Tennis Court 2', 200, 'expensive')
('Badminton Court', 50, 'cheap')
('Table Tennis', 10, 'cheap')
('Massage Room 1', 3000, 'expensive')
('Massage Room 2', 3000, 'expensive')
('Squash Court', 80, 'cheap')
('Snooker Table', 15, 'cheap')
('Pool Table', 15, 'cheap')

In [121]:
# Using sqlite3 and pandas.
query5df = pd.read_sql_query('SELECT name, monthlymaintenance, IIF(monthlymaintenance>100, "expensive", "cheap") FROM Facilities', con)
query5df

,name,monthlymaintenance,"IIF(monthlymaintenance>100, ""expensive"", ""cheap"")"
0,Tennis Court 1,200,expensive
1,Tennis Court 2,200,expensive
2,Badminton Court,50,cheap
3,Table Tennis,10,cheap
4,Massage Room 1,3000,expensive
5,Massage Room 2,3000,expensive
6,Squash Court,80,cheap
7,Snooker Table,15,cheap
8,Pool Table,15,cheap

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution.

A6:<br>

><code>SELECT firstname, surname FROM Members<br>
>WHERE joindate =<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(SELECT MAX(joindate) FROM Members);</code>

In [122]:
# Using only sqlite3.
cur.execute('SELECT firstname, surname FROM Members WHERE joindate = (SELECT MAX(joindate) FROM Members)')
query6 = cur.fetchall()
for fac in query6:
    print(fac)

('Darren', 'Smith')

In [123]:
# Using sqlite3 and pandas.
query6df = pd.read_sql_query('SELECT firstname, surname FROM Members WHERE joindate = (SELECT MAX(joindate) FROM Members)', con)
query6df

  firstname surname
0    Darren   Smith

Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

A7:<br>

><code>SELECT Facilities.name, Members.firstname || " " || Members.surname AS full_name<br>
>FROM Bookings<br>
>INNER JOIN Members ON Members.memid = Bookings.memid<br>
>INNER JOIN Facilities ON Facilities.facid = Bookings.facid<br>
>WHERE Bookings.facid IN (0, 1)<br>
>GROUP BY full_name<br>
>ORDER BY full_name;</code>

In [124]:
# Using only sqlite3.
cur.execute('SELECT Facilities.name, Members.firstname || " " || Members.surname AS full_name FROM Bookings INNER JOIN Members ON Members.memid = Bookings.memid INNER JOIN Facilities ON Facilities.facid = Bookings.facid WHERE Bookings.facid IN (0, 1) GROUP BY full_name ORDER BY full_name;')
query7 = cur.fetchall()
for fac in query7:
    print(fac)

('Tennis Court 1', 'Anne Baker')
('Tennis Court 2', 'Burton Tracy')
('Tennis Court 1', 'Charles Owen')
('Tennis Court 2', 'Darren Smith')
('Tennis Court 1', 'David Farrell')
('Tennis Court 2', 'David Jones')
('Tennis Court 1', 'David Pinker')
('Tennis Court 1', 'Douglas Jones')
('Tennis Court 1', 'Erica Crumpet')
('Tennis Court 2', 'Florence Bader')
('Tennis Court 2', 'GUEST GUEST')
('Tennis Court 1', 'Gerald Butters')
('Tennis Court 2', 'Henrietta Rumney')
('Tennis Court 1', 'Jack Smith')
('Tennis Court 1', 'Janice Joplette')
('Tennis Court 2', 'Jemima Farrell')
('Tennis Court 1', 'Joan Coplin')
('Tennis Court 1', 'John Hunt')
('Tennis Court 1', 'Matthew Genting')
('Tennis Court 2', 'Millicent Purview')
('Tennis Court 2', 'Nancy Dare')
('Tennis Court 2', 'Ponder Stibbons')
('Tennis Court 2', 'Ramnaresh Sarwin')
('Tennis Court 2', 'Tim Boothe')
('Tennis Court 2', 'Tim Rownam')
('Tennis Court 2', 'Timothy Baker')
('Tennis Court 1', 'Tracy Smith')

In [125]:
# Using sqlite3 and pandas.
query7df = pd.read_sql_query('SELECT Facilities.name, Members.firstname || " " || Members.surname AS full_name FROM Bookings INNER JOIN Members ON Members.memid = Bookings.memid INNER JOIN Facilities ON Facilities.facid = Bookings.facid WHERE Bookings.facid IN (0, 1) GROUP BY full_name ORDER BY full_name;', con)
query7df

              name          full_name
0   Tennis Court 1         Anne Baker
1   Tennis Court 2       Burton Tracy
2   Tennis Court 1       Charles Owen
3   Tennis Court 2       Darren Smith
4   Tennis Court 1      David Farrell
5   Tennis Court 2        David Jones
6   Tennis Court 1       David Pinker
7   Tennis Court 1      Douglas Jones
8   Tennis Court 1      Erica Crumpet
9   Tennis Court 2     Florence Bader
10  Tennis Court 2        GUEST GUEST
11  Tennis Court 1     Gerald Butters
12  Tennis Court 2   Henrietta Rumney
13  Tennis Court 1         Jack Smith
14  Tennis Court 1    Janice Joplette
15  Tennis Court 2     Jemima Farrell
16  Tennis Court 1        Joan Coplin
17  Tennis Court 1          John Hunt
18  Tennis Court 1    Matthew Genting
19  Tennis Court 2  Millicent Purview
20  Tennis Court 2         Nancy Dare
21  Tennis Court 2    Ponder Stibbons
22  Tennis Court 2   Ramnaresh Sarwin
23  Tennis Court 2         Tim Boothe
24  Tennis Court 2         Tim Rownam
25  Tennis Court 2      Timothy Baker
26  Tennis Court 1        Tracy Smith

Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.

A8:<br>

><code>SELECT Facilities.name, Members.firstname || " " || Members.surname AS full_name, IIF(Members.memid = 0, Bookings.slots * Facilities.guestcost, Bookings.slots * Facilities.membercost) AS total_cost<br>
>FROM Bookings<br>
>INNER JOIN Members ON Members.memid = Bookings.memid<br>
>INNER JOIN Facilities ON Facilities.facid = Bookings.facid<br>
>WHERE Bookings.starttime LIKE '2012-09-14%'<br>
>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AND total_cost > 30<br>
>GROUP BY full_name<br>
>ORDER BY full_name</code>

In [126]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 8.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('Tennis Court 1', 'GUEST GUEST', 75)
('Massage Room 1', 'Jemima Farrell', 39.6)

In [127]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

             name       full_name  total_cost
0  Tennis Court 1     GUEST GUEST        75.0
1  Massage Room 1  Jemima Farrell        39.6

Q9: This time, produce the same result as in Q8, but using a subquery.

A9:<br>

><code></code>

In [128]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 9.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('Tennis Court 1', 'GUEST GUEST', 75)
('Massage Room 1', 'Jemima Farrell', 39.6)

In [129]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

             name       full_name  total_cost
0  Tennis Court 1     GUEST GUEST        75.0
1  Massage Room 1  Jemima Farrell        39.6

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

A10:<br>

><code>SELECT Facilities.name, ROUND(SUM(IIF(Bookings.memid != 0, Bookings.slots * Facilities.membercost, 0) + IIF(Bookings.memid != 0, Bookings.slots * Facilities.guestcost, 0)), 2) AS total_revenue<br>
>FROM Bookings<br>
>INNER JOIN Members ON Members.memid = Bookings.memid<br>
>INNER JOIN Facilities ON Facilities.facid = Bookings.facid<br>
>GROUP BY Facilities.name;</code>

In [130]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 10.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('Badminton Court', 18739.5)
('Massage Room 1', 121071.6)
('Massage Room 2', 18774.6)
('Pool Table', 4550.0)
('Snooker Table', 4540.0)
('Squash Court', 20783.0)
('Table Tennis', 4150.0)
('Tennis Court 1', 37785.0)
('Tennis Court 2', 36360.0)

In [135]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

                  full_name
0               GUEST GUEST
1              Darren Smith
2               Tracy Smith
3                Tim Rownam
4           Janice Joplette
5            Gerald Butters
6              Burton Tracy
7                Nancy Dare
8                Tim Boothe
9           Ponder Stibbons
10             Charles Owen
11              David Jones
12               Anne Baker
13           Jemima Farrell
14               Jack Smith
15           Florence Bader
16            Timothy Baker
17             David Pinker
18          Matthew Genting
19           Anna Mackenzie
20              Joan Coplin
21         Ramnaresh Sarwin
22            Douglas Jones
23         Henrietta Rumney
24            David Farrell
25  Henry Worthington-Smyth
26        Millicent Purview
27      Hyacinth Tupperware
28                John Hunt
29            Erica Crumpet
30             Darren Smith

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

A11:<br>

><code>SELECT a.firstname || " " || a.surname AS full_name, b.firstname || " " || b.surname AS recommended_by<br>
>FROM Members a<br>
>INNER JOIN Members b ON b.memid = a.recommendedby<br>
>ORDER BY a.surname;</code>

In [146]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 11.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('Florence Bader', 'Ponder Stibbons')
('Anne Baker', 'Ponder Stibbons')
('Timothy Baker', 'Jemima Farrell')
('Tim Boothe', 'Tim Rownam')
('Gerald Butters', 'Darren Smith')
('Joan Coplin', 'Timothy Baker')
('Erica Crumpet', 'Tracy Smith')
('Nancy Dare', 'Janice Joplette')
('Matthew Genting', 'Gerald Butters')
('John Hunt', 'Millicent Purview')
('David Jones', 'Janice Joplette')
('Douglas Jones', 'David Jones')
('Janice Joplette', 'Darren Smith')
('Anna Mackenzie', 'Darren Smith')
('Charles Owen', 'Darren Smith')
('David Pinker', 'Jemima Farrell')
('Millicent Purview', 'Tracy Smith')
('Henrietta Rumney', 'Matthew Genting')
('Ramnaresh Sarwin', 'Florence Bader')
('Jack Smith', 'Darren Smith')
('Ponder Stibbons', 'Burton Tracy')
('Henry Worthington-Smyth', 'Tracy Smith')

In [160]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

              name  SUM(IIF(Bookings.memid != 0, slots, 0))
0  Badminton Court                                     1086
1   Massage Room 1                                      884
2   Massage Room 2                                       54
3       Pool Table                                      856
4    Snooker Table                                      860
5     Squash Court                                      418
6     Table Tennis                                      794
7   Tennis Court 1                                      957
8   Tennis Court 2                                      882

Q12: Find the facilities with their usage by member, but not guests

A12:<br>

><code>SELECT Facilities.name, SUM(IIF(Bookings.memid != 0, slots, 0)) AS slot_usage<br>
>FROM Bookings<br>
>INNER JOIN Facilities ON Facilities.facid = Bookings.facid<br>
>GROUP BY Facilities.name;</code>

In [161]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 12.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('Badminton Court', 1086)
('Massage Room 1', 884)
('Massage Room 2', 54)
('Pool Table', 856)
('Snooker Table', 860)
('Squash Court', 418)
('Table Tennis', 794)
('Tennis Court 1', 957)
('Tennis Court 2', 882)

In [162]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

              name  slot_usage
0  Badminton Court        1086
1   Massage Room 1         884
2   Massage Room 2          54
3       Pool Table         856
4    Snooker Table         860
5     Squash Court         418
6     Table Tennis         794
7   Tennis Court 1         957
8   Tennis Court 2         882

Q13: Find the facilities usage by month, but not guests.

A13:<br>

><code>SELECT SUBSTR(Bookings.starttime, 6, 2) || '/' || SUBSTR(Bookings.starttime, 1, 4) AS month, Facilities.name, SUM(IIF(Bookings.memid != 0, slots, 0)) AS slot_usage<br>
>FROM Bookings<br>
>INNER JOIN Facilities ON Facilities.facid = Bookings.facid<br>
>GROUP BY month, Facilities.name<br>
>ORDER BY month, Facilities.name;</code>

In [170]:
# Using only sqlite3.

# Writing SQL code on Nopepad++ for convencience of formatting.
sql_file = open('query 13.sql', 'r')
sql_query = sql_file.read()
sql_file.close()

cur.execute(sql_query)
query_file = cur.fetchall()
for fac in query_file:
    print(fac)

('07/2012', 'Badminton Court', 165)
('07/2012', 'Massage Room 1', 166)
('07/2012', 'Massage Room 2', 8)
('07/2012', 'Pool Table', 110)
('07/2012', 'Snooker Table', 140)
('07/2012', 'Squash Court', 50)
('07/2012', 'Table Tennis', 98)
('07/2012', 'Tennis Court 1', 201)
('07/2012', 'Tennis Court 2', 123)
('08/2012', 'Badminton Court', 414)
('08/2012', 'Massage Room 1', 316)
('08/2012', 'Massage Room 2', 18)
('08/2012', 'Pool Table', 303)
('08/2012', 'Snooker Table', 316)
('08/2012', 'Squash Court', 184)
('08/2012', 'Table Tennis', 296)
('08/2012', 'Tennis Court 1', 339)
('08/2012', 'Tennis Court 2', 345)
('09/2012', 'Badminton Court', 507)
('09/2012', 'Massage Room 1', 402)
('09/2012', 'Massage Room 2', 28)
('09/2012', 'Pool Table', 443)
('09/2012', 'Snooker Table', 404)
('09/2012', 'Squash Court', 184)
('09/2012', 'Table Tennis', 400)
('09/2012', 'Tennis Court 1', 417)
('09/2012', 'Tennis Court 2', 414)

In [171]:
# Using sqlite3 and pandas.
querydf = pd.read_sql_query(sql_query, con)
querydf

      month             name  slot_usage
0   07/2012  Badminton Court         165
1   07/2012   Massage Room 1         166
2   07/2012   Massage Room 2           8
3   07/2012       Pool Table         110
4   07/2012    Snooker Table         140
5   07/2012     Squash Court          50
6   07/2012     Table Tennis          98
7   07/2012   Tennis Court 1         201
8   07/2012   Tennis Court 2         123
9   08/2012  Badminton Court         414
10  08/2012   Massage Room 1         316
11  08/2012   Massage Room 2          18
12  08/2012       Pool Table         303
13  08/2012    Snooker Table         316
14  08/2012     Squash Court         184
15  08/2012     Table Tennis         296
16  08/2012   Tennis Court 1         339
17  08/2012   Tennis Court 2         345
18  09/2012  Badminton Court         507
19  09/2012   Massage Room 1         402
20  09/2012   Massage Room 2          28
21  09/2012       Pool Table         443
22  09/2012    Snooker Table         404
23  09/2012     Squash Court         184
24  09/2012     Table Tennis         400
25  09/2012   Tennis Court 1         417
26  09/2012   Tennis Court 2         414